.emacs.d/UseEmacs/Use-cnblogs-in-Emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>用Emacs org写博文（cnblogs)</title>
<!-- 2014-11-20 周四 21:59 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Erwin Zhu" />
</head>
<body>
<div id="content">
<h1 class="title">用Emacs org写博文（cnblogs)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 1.说明：</a></li>
<li><a href="#sec-2">2. 2.使用cnblogs发博客</a>
<ul>
<li><a href="#sec-2-1">2.1. 设置cnblogs账户</a></li>
<li><a href="#sec-2-2">2.2. 验证成功后发博文</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 1.说明：</h2>
<div class="outline-text-2" id="text-1">
<p>
一直想写博客，但是一般博客的编辑工具对于用户来说既要内容又要专注格式（怎么排版），就我个人而言，这样让我颇耗费Time，所以不怎么喜欢记录。而Emacs的org对于记录文档等等之类简直是神器，而Emacs让我最入迷之一的就是org，到现在为止不管写什么都是用*.org来写的，最爱~。
本文记录了我怎么用一个插件  <a href="https://github.com/huwenbiao/cnblogs">cnblogs(点击进入插件目录)</a> 来发博客的，可以说是对原作者的说明文档的一点小小补充。
cnblogs出处作者：huwenbiao
Thanks.
</p>

<p>
本文保留所有权，仅作参考只用，转载请注明出处及原作者姓名（erwin），help you, help me.
本文如有侵权，请联系本人:erwin<sub>zhu</sub>@163.com 
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 2.使用cnblogs发博客</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 设置cnblogs账户</h3>
<div class="outline-text-3" id="text-2-1">
<p>
首先按照上面给的cnblogs地址安装好cnblogs插件，<a href="http://www.cnblogs.com/Open_Source/archive/2012/09/14/2684897.html">关于cnblogs的博文（应该是原作者的）</a>。  这里要注意一下：在输入以下命令设置账户的时候，其中的username(第二个，非UserID)可以在图1地方找到
</p>
<div class="org-src-container">

<pre class="src src-<elisp>">M-x cnblogs-setup-blog
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 验证成功后发博文</h3>
<div class="outline-text-3" id="text-2-2">
<p>
这里又要注意一下：你写好org的时候，在org下是不能直接发布的，要以如下方式
</p>
<div class="org-src-container">

<pre class="src src-<elisp>">C-c C-e
h h
</pre>
</div>
<p>
将org转换成html格式后，打开对应html文件，在输入
</p>
<div class="org-src-container">

<pre class="src src-<elisp>">M-x cnblogs-import-file
</pre>
</div>
<p>
导入对应的*html文件提示成功后，就成功发布了博文，到博客园目录下刷新就有了。
</p>

<p>
如有不明白的地方，可以留言。 help you, help me.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Erwin Zhu</p>
<p class="date">Created: 2014-11-20 周四 21:59</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
